Revit 2024 API
FabricationPart.CanAdjustEndLength Method
 Checks if the end of fabrication part can be adjusted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool CanAdjustEndLength(
	Connector connector
)
Visual Basic
Public Function CanAdjustEndLength ( _
	connector As Connector _
) As Boolean
Visual C++
public:
bool CanAdjustEndLength(
	Connector^ connector
)
Parameters
connector
Type: Autodesk.Revit.DB.Connector
 The connector of the fabrication part to adjust length.
Return Value
 True if the end of fabrication part can be adjusted.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace